benchmark/benchmark.txt
1) Отдача статического документа напрямую через nginx:
ab -c 10 -n 1000 http://127.0.0.1/static/css/style.css
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /static/css/style.css
Document Length:        13118 bytes

Concurrency Level:      10
Time taken for tests:   0.153 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      13399000 bytes
HTML transferred:       13118000 bytes
Requests per second:    6539.75 [#/sec] (mean)
Time per request:       1.529 [ms] (mean)
Time per request:       0.153 [ms] (mean, across all concurrent requests)
Transfer rate:          85572.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.7      0       8
Processing:     0    1   1.0      1      10
Waiting:        0    0   0.6      0       8
Total:          0    1   1.4      1      11
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      4
  98%      7
  99%      9
 100%     11 (longest request)
 
 
 
2) Отдача статического документа напрямую через gunicorn:
ab -c 10 -n 1000 http://127.0.0.1:8000/static/css/style.css
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /static/css/style.css
Document Length:        13118 bytes

Concurrency Level:      10
Time taken for tests:   0.916 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      13482000 bytes
HTML transferred:       13118000 bytes
Requests per second:    1091.41 [#/sec] (mean)
Time per request:       9.162 [ms] (mean)
Time per request:       0.916 [ms] (mean, across all concurrent requests)
Transfer rate:          14369.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.0      0      11
Processing:     1    9   4.3      8      34
Waiting:        1    8   4.1      7      33
Total:          2    9   4.4      8      34

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%     10
  80%     10
  90%     15
  95%     19
  98%     24
  99%     28
 100%     34 (longest request)



3) Отдача динамического документа напрямую через gunicorn:
ab -c 10 -n 1000 http://127.0.0.1:8000/settings
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /settings
Document Length:        3882 bytes

Concurrency Level:      10
Time taken for tests:   4.761 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      4171000 bytes
HTML transferred:       3882000 bytes
Requests per second:    210.04 [#/sec] (mean)
Time per request:       47.610 [ms] (mean)
Time per request:       4.761 [ms] (mean, across all concurrent requests)
Transfer rate:          855.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0      17
Processing:     7   47   9.6     46      84
Waiting:        7   47   9.6     46      84
Total:          8   47   9.6     46      84

Percentage of the requests served within a certain time (ms)
  50%     46
  66%     50
  75%     53
  80%     55
  90%     61
  95%     64
  98%     70
  99%     73
 100%     84 (longest request)
 
 
 


4) Отдача динамического документа через проксирование запроса с nginx на gunicorn:
ab -c 10 -n 1000 http://127.0.0.1/settings
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /settings
Document Length:        3877 bytes

Concurrency Level:      10
Time taken for tests:   4.536 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      4179000 bytes
HTML transferred:       3877000 bytes
Requests per second:    220.47 [#/sec] (mean)
Time per request:       45.357 [ms] (mean)
Time per request:       4.536 [ms] (mean, across all concurrent requests)
Transfer rate:          899.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:    10   45   9.6     44      95
Waiting:        9   45   9.6     44      95
Total:         10   45   9.6     44      95

Percentage of the requests served within a certain time (ms)
  50%     44
  66%     48
  75%     51
  80%     52
  90%     57
  95%     62
  98%     69
  99%     74
 100%     95 (longest request)



5) Отдача динамического документа через проксирование запроса с nginx на gunicorn, при кэшировние ответа на nginx (proxy cache):
ab -c 10 -n 1000 http://127.0.0.1/settings
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        nginx/1.18.0
Server Hostname:        127.0.0.1
Server Port:            80

Document Path:          /settings
Document Length:        3877 bytes

Concurrency Level:      10
Time taken for tests:   0.157 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      4179000 bytes
HTML transferred:       3877000 bytes
Requests per second:    6356.51 [#/sec] (mean)
Time per request:       1.573 [ms] (mean)
Time per request:       0.157 [ms] (mean, across all concurrent requests)
Transfer rate:          25941.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.5      0      24
Processing:     0    1   1.8      1      25
Waiting:        0    1   1.6      0      21
Total:          0    2   2.8      1      35

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      3
  98%      5
  99%     25
 100%     35 (longest request)


Насколько быстрее отдается статика по сравнению с WSGI? NGINX раздает статику быстрее, чем WSGI в 6 раз
Во сколько раз ускоряет работу proxy_cache? proxy_cache ускоряет раздачу динамики в 30 раз